usr.sbin/watchdogd/watchdog.8
.\" Copyright (c) 2004  Poul-Henning Kamp <phk@frebsd.org>
.\" Copyright (c) 2003  Sean M. Kelly <smkelly@frebsd.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $NQC$
.\"
.Dd October 18, 2014
.Dt WATCHDOG 8
.Os
.Sh NAME
.Nm watchdog
.Nd watchdog control program
.Sh SYNOPSIS
.Nm
.Op Fl d
.Op Fl t Ar timeout
.Sh DESCRIPTION
The
.Nm
utility can be used to control the kernel's watchdog facility.
.Pp
The
.Fl d
option
enables debugging.
.Pp
The
.Fl t Ar timeout
option
specifies the desired timeout period in seconds, a value of
zero will disable the watchdog.
The default timeout is 128 seconds.
.Sh SEE ALSO
.Xr watchdog 4 ,
.Xr watchdogd 8 ,
.Xr watchdog 9
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 5.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
utility and manual page were written by
.An Sean Kelly Aq Mt smkelly@frebsd.org
and
.An Poul-Henning Kamp Aq Mt phk@frebsd.org .
.Pp
Some contributions made by
.An Jeff Roberson Aq Mt jeff@frebsd.org .
